config.org
:DOC-CONFIG:
# Tangle by default to config.el, which is the most common case
#+property: header-args:emacs-lisp :tangle config.el
#+property: header-args :mkdirp yes :comments no
#+startup: fold
:END:

#+title: Config
#+author: Cédric Da Fonseca

* Level 1: Hangar · Introduction
#+begin_quote
Welcome to Doom, soldier. Now shut up and start +fighting+ coding because
there's no time to waste!
#+end_quote
Welcome again, this is my personal Emacs configuration for the [[https://github.com/doomemacs/doomemacs][Doom]] framework.
In this ~config.org~ file lies most of my Emacs config. This is a literate
config, this means, the code that I stole from more competent person than myself
will be generated to a nice Emacs config.

Why literate? Well this allows me to have a nicely organized configuration, with
lots of comments which helps to give a false sense of order and quality.
** Before we start
What better to kick off this configuration than putting a line of code that I
have no idea what it does? Apparently it helps things running faster, me like
fast.
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src
** Inspirations
- [[https://github.com/abougouffa/dotfiles/blob/main/dot_doom.d/config.org][Abdelhak Bougouffa's config]]

* Level 2: Nuclear Plant · Let's get personal
Please allow me to introduce myself.
#+begin_src emacs-lisp
(setq user-full-name "Cédric Da Fonseca"
      user-mail-address "captain.spof@gmail.com")
#+end_src
* Level 3: Toxin Refinery · Defaults be bad
This is the customary browsing through the game settings to change the default
parameters…

I often use ~zt~, ~zz~ and ~zb~ to scroll through my window, this help to keep a
tiny bit of context above and bellow the current line.
#+begin_src emacs-lisp
(setq-default scroll-margin 3)
#+end_src

I found these settings somewhere, they're supposed to help with «performance»,
so it must be good, right?

#+begin_src emacs-lisp
(setq gcmh-high-cons-threshold most-positive-fixnum
      max-specpdl-size 100000)
(setq gc-cons-threshold (* 100 1024 1024)) ;; REVIEW: might be overkill
#+end_src

The =leader= and =localleader= keys are great, but I want my own, this way, I am
sure my key bindings won't interfer with anythings. I chose =SPC ç=, but I might
change it to something else, maybe a dedicated key on my keyboard…

#+begin_src emacs-lisp
(defvar daf/localleader-key "SPC ç"
  "The localleader prefix key, for major-mode specific commands.")
#+end_src

** ~which-key~
*** Configuration

#+begin_src emacs-lisp :tangle packages.el
(unpin! which-key)
#+end_src
~which-key~ could be a little tad bit quicker to show up.

#+begin_src emacs-lisp
;; (setq which-key-idle-delay 0.5) ;; I need the help, I really do
#+end_src

I also think that having evil- appear in so many popups is a bit too verbose,
let’s change that.
#+begin_src emacs-lisp
(setq which-key-allow-multiple-replacements t)
(after! which-key
  (pushnew!
   which-key-replacement-alist
   '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "⫚-\\1"))
   '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "⋔\\1"))))
#+end_src
** Neat · 📷
When using ~evil-mode~, you can rebind ~v~ to ~er/expand-region~, this is super
useful, keep hitting ~v~ to further expand the selection!
#+begin_src emacs-lisp
(map!
 (:map 'override
  :v "v" #'er/expand-region
  :v "V" #'er/contract-region))
#+end_src
#+begin_quote
When I bring up Doom's scratch buffer with SPC x, it's often to play with elisp
or note something down (that isn't worth an entry in my notes). I can do both in
`lisp-interaction-mode'.

---hlissner
#+end_quote

#+begin_src emacs-lisp
(setq doom-scratch-initial-major-mode 'lisp-interaction-mode)
#+end_src

#+begin_src emacs-lisp
(after! embark
(eval-when-compile
  (defmacro my/embark-ace-action (fn)
    `(defun ,(intern (concat "my/embark-ace-" (symbol-name fn))) ()
       (interactive)
       (with-demoted-errors "%s"
         (require 'ace-window)
         (let ((aw-dispatch-always t))
           (aw-switch-to-window (aw-select nil))
           (call-interactively (symbol-function ',fn)))))))

    (define-key embark-file-map     (kbd "o") (my/embark-ace-action find-file))
    (define-key embark-buffer-map   (kbd "o") (my/embark-ace-action switch-to-buffer))
    (define-key embark-bookmark-map (kbd "o") (my/embark-ace-action bookmark-jump)))
#+end_src

*** Window · 🪟

Resizing window pixel per pixel is tiresome, lets make it easier to resize by
maintaining the key pressed.
#+begin_src emacs-lisp
;;;###autoload
(defmacro daf/repeat-map! (map-name keys-alist &optional docstring)
  "A helper macro to create keymaps for repeatable actions.

MAP-NAME is the variable name for the sparse keymap created, and KEYS-ALIST, is
an association list of functions to keys, where each function is called after
the associated key is pressed after the repeatable action is triggered."
  `(defvar ,map-name
     (let ((map (make-sparse-keymap)))
       (dolist (cmd ,keys-alist)
         (define-key map (cdr cmd) (car cmd))
         (put (car cmd) 'repeat-map ',map-name))
       map)
     ,docstring))

(add-hook 'after-init-hook 'repeat-mode)

(daf/repeat-map! my-window-resize-repeat-map
                 '((evil-window-increase-height . "+")
                   (evil-window-increase-height . "=")
                   (evil-window-decrease-height . "-")
                   (evil-window-increase-width . ">")
                   (evil-window-decrease-width . "<"))
                 "Repeatable map for window resizing")
#+end_src

* Level 4: Command Control · Doom, but it's my personal hell
Here, I'll put configuration for the module built-in ~doom~. Either grouped by
package, or by theme.
** Completion · ~:completion~
*** ~company~
**** Configuration
#+begin_src emacs-lisp
(after! company
  (setq
   company-show-quick-access 'left
   company-quick-access-keys '("b" "é" "p" "o" "w")
   company-quick-access-modifier 'control
   company-dabbrev-other-buffers t)

  (set-company-backend! 'prog-mode '(company-capf company-dabbrev company-dabbrev-code)))
#+end_src

*** ~embark~
**** Mapping
~C-;~ is three key presses in a bépo keyboard, let's add a more accessible
binding.
#+begin_src emacs-lisp
(map! [remap describe-bindings] #'embark-bindings
      "C-," #'embark-act)
#+end_src
** Themes · pretty little thing ~:ui~

This might change from time to time, but currently I am rocking…
#+begin_src emacs-lisp
(setq doom-theme 'ef-duo-light)
(setq ef-themes-to-toggle '(ef-duo-light ef-night))
#+end_src
*** Splash screen

Ferris is just too cute, I need to see him everyday…
#+begin_src emacs-lisp
(setq fancy-splash-image (expand-file-name "misc/splash-images/ferris.svg" doom-user-dir))
#+end_src
…and only him, remove the dashboard shortcuts, I'll customize them later anyway.
#+begin_src emacs-lisp
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
#+end_src

*** Dashboard
**** Configuration & Mapping

#+begin_quote :
When using the dashboard, there are often a small number of actions I will take.
As the dashboard is it's own major mode, there is no need to suffer the tyranny
of unnecessary keystrokes --- we can simply bind common actions to a single key!

---Tecosaur
#+end_quote
☝ What he says, also adding some shortcuts of my own.

#+begin_src emacs-lisp
(defun +doom-dashboard-setup-modified-keymap ()
  (setq +doom-dashboard-mode-map (make-sparse-keymap))
  (map! :map +doom-dashboard-mode-map
        :desc "Find file"            :ne "f" #'find-file
        :desc "Recent files"         :ne "r" #'consult-recent-file
        :desc "Restore last session" :ne "R" #'doom/restart-and-restore
        :desc "Config dir"           :ne "C" #'doom/open-private-config
        :desc "Open config.org"      :ne "c" (cmd! (find-file (expand-file-name "config.org" doom-user-dir)))
        :desc "Open dotfile"         :ne "." (cmd! (doom-project-find-file "~/.config/"))
        :desc "Notes (roam)"         :ne "n" #'org-roam-node-find
        :desc "Switch buffer"        :ne "b" #'+vertico/switch-workspace-buffer
        :desc "Switch buffers (all)" :ne "B" #'consult-buffer
        :desc "IBuffer"              :ne "i" #'ibuffer
        :desc "Projects"             :ne "p" #'project-switch-project
        :desc "Set theme"            :ne "t" #'consult-theme
        :desc "Quit"                 :ne "Q" #'save-buffers-kill-terminal
        :desc "Show keybindings"     :ne "h" (cmd! (which-key-show-keymap '+doom-dashboard-mode-map))))

(add-transient-hook! #'+doom-dashboard-mode (+doom-dashboard-setup-modified-keymap))
(add-transient-hook! #'+doom-dashboard-mode :append (+doom-dashboard-setup-modified-keymap))
(add-hook! 'doom-init-ui-hook :append (+doom-dashboard-setup-modified-keymap))
#+end_src

#+begin_quote
Unfortunately the show keybindings help doesn't currently work as intended, but
this is still quite nice overall.

Now that the dashboard is so convenient, I'll want to make it easier to get to.

---Tecosaur
#+end_quote

#+begin_src emacs-lisp
(map! :leader :desc "Dashboard" "D" #'+doom-dashboard/open)
#+end_src
*** Modeline
**** Configuration
What is that little ball in the left bottom doing anyway? Remove it!
#+begin_src emacs-lisp
;; An evil mode indicator is redundant with cursor shape
(advice-add #'doom-modeline-segment--modals :override #'ignore)
#+end_src

#+begin_quote
However, by default red text is used in the modeline, so let’s make that orange
so I don’t feel like something’s gone wrong when editing files.
---Tecosaur
#+end_quote

#+begin_src emacs-lisp
(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "orange"))
#+end_src
*** Workspace
****   Mapping
Invert Switch workspace and Display tab bar mapping
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("TAB" . "workspace")
       :desc "Switch workspace" :mvn "TAB" #'+workspace/switch-to
       :desc "Display tab bar" :mvn "." #'+workspace/display))

#+end_src
** Editor · ~:editor~
*** ~fold~
**** Mapping
Quickly toggle fold
#+begin_src emacs-lisp
(after! evil
  (map!
   :n "z <tab>" #'+fold/toggle))
#+end_src
*** ~lispy~
