config.org
**** Configuration
#+begin_src emacs-lisp :tangle packages.el
(unpin! lispyville)
#+end_src

#+begin_src emacs-lisp
;; (use-package! lispyville
;;   :when (modulep! :editor evil)
;;   :hook (lispy-mode . lispyville-mode)
;;   :init
;;   (setq lispyville-key-theme
;;         '((operators normal)
;;           c-w
;;           (prettify insert)
;;           (atom-movement t)
;;           slurp/barf-lispy
;;           commentary
;;           additional
;;           additional-insert))
;;   :config
;;   (lispyville-set-key-theme)
;;   (add-hook! 'evil-escape-inhibit-functions
;;     (defun +lispy-inhibit-evil-escape-fn ()
;;       (and lispy-mode (evil-insert-state-p)))))
#+end_src

** Emacs · ~:emacs~ itself
*** ~undo-fu~
**** Configuration
#+begin_src emacs-lisp
(setq undo-fu-allow-undo-in-region 't)
#+end_src
*** ~ediff~
**** Configuration
Take A or B, why not both ?
#+begin_src emacs-lisp
(defun ediff-copy-both-to-C ()
  (interactive)
  (ediff-copy-diff ediff-current-difference nil 'C nil
                   (concat
                    (ediff-get-region-contents ediff-current-difference 'A ediff-control-buffer)
                    (ediff-get-region-contents ediff-current-difference 'B ediff-control-buffer))))
(defun add-d-to-ediff-mode-map () (define-key ediff-mode-map "d" 'ediff-copy-both-to-C))
(add-hook 'ediff-keymap-setup-hook 'add-d-to-ediff-mode-map)
#+end_src
** Term · ~:term~
I still need to learn to *stay* in Emacs when in comes to shell, but luckily we
have ~eshell~ and ~vterm~ for that. I am still undecided between the two, so I use
them both!

*** ~vterm~
**** Configuration & Mapping
I had some visual issue with my default font when rendering some symbols in the
prompt. So lets set a specific font for ~vterm~.
#+begin_src emacs-lisp
;; Use monospaced font faces in current buffer
(defun +vterm-mode-setup ()
  "Sets a fixed width (monospace) font in current buffer"
  (setq buffer-face-mode-face '(:family "IBM Plex Mono" :height 120))
  (face-remap-add-relative 'fixed-pitch)
  (buffer-face-mode))

(add-hook 'vterm-mode-hook #'+vterm-mode-setup)
#+end_src

~eshell~ has helpfull functions to open a split right and bellow, lets do the same
for ~vterm~.

#+begin_src emacs-lisp
(defun +vterm/split-right ()
  "Create a new vterm window to the right of the current one."
  (interactive)
  (let* ((ignore-window-parameters t)
         (dedicated-p (window-dedicated-p)))
    (select-window (split-window-horizontally))
    (+vterm/here default-directory)))

(defun +vterm/split-below ()
  "Create a new vterm window below the current one."
  (interactive)
  (let* ((ignore-window-parameters t)
         (dedicated-p (window-dedicated-p)))
    (select-window (split-window-vertically))
    (+vterm/here default-directory)))
#+end_src

Now lets put all this into a global binding, I'll use ~SPC e~.
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("e" . "(e)shell")
       :desc "toggle eshell popup"           "E" #'+eshell/toggle
       :desc "open eshell here"              "e" #'+eshell/here
       :desc "open eshell in project root"   "p" #'project-eshell
       :desc "eshell below"                  "K" #'+eshell/split-below
       :desc "eshell right"                  "V" #'+eshell/split-right
       :desc "toggle vterm popup"            "T" #'+vterm/toggle
       :desc "open vterm here"               "t" #'+vterm/here
       :desc "vterm below"                   "k" #'+vterm/split-below
       :desc "vterm right"                   "v" #'+vterm/split-right))
#+end_src

** Checkers · ~:check(er)~ mate
*** ~langtool~
**** Configuration
~langtool~ isn't cutting it for me, I'll setup ~languagetool.el~ latter on.
#+begin_src emacs-lisp :tangle packages.el
(package! langtool :disable t)
#+end_src
*** ~flycheck~
**** Configuration & Mapping
I write mostly bad code, so I need to jump to problems easily.

#+begin_src emacs-lisp :tangle packages.el
(unpin! flycheck)
#+end_src

#+begin_src emacs-lisp
(map!
 (:after flycheck
         (:map flycheck-mode-map
               "M-n" #'flycheck-next-error
               "M-p" #'flycheck-previous-error)))
#+end_src

** Tools · the sharpest ~:tool~ in the shed
*** ~lookup~ · « Ahh we used to look up at the sky and wonder…»
**** Mapping
In situation when I need to quickly look a word definition to not look too dumb.
#+begin_src emacs-lisp
(map!
 (:when (modulep! :tools lookup)
   :n "z?" #'define-word-at-point))
#+end_src
** ~evil~ · the necessary one
*** Configuration

When creating window split, it's nice to jump straight to them.
#+begin_src emacs-lisp
(after! evil
  (setq evil-split-window-below t
        evil-vsplit-window-right t))
#+end_src

Save a few key stroke, open up ~projecile-find-file~ while we're at it.

#+begin_src emacs-lisp
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (dired-jump))
#+end_src

I like my s/../.. to by global by default
#+begin_src emacs-lisp
(after! evil
  (setq evil-ex-substitute-global t))
#+end_src

I use ~o~, ~O~ often, but not much for amending comments, let's disable that.
#+begin_src emacs-lisp
(after! evil
  (setq +evil-want-o/O-to-continue-comments nil))
#+end_src

*** Mapping
Habits die hard, I use ~q~ to close most things, I want to close buffer too.
This mean macro should be relocated to ~Q~.
#+begin_src emacs-lisp
(with-eval-after-load 'evil-maps
  (define-key evil-normal-state-map "q" 'evil-quit)
  (define-key evil-motion-state-map (kbd "Q") 'evil-record-macro))
#+end_src
** ~dired~ · « Our last resort, in these dire times »
*** Mapping
Conveniently Doom doesn't use ~SPC d~ and I use dired often, so let's add a few
key bindings.

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("d" . "dired")
       :desc "Dired"                       "." #'dired
       :desc "Dired jump to current"       "d" #'dired-jump
       :desc "fd input to dired"           "f" #'fd-dired
       :desc "Dired into project root"     "p" #'project-dired
       :desc "open dired in another frame" "D" #'dired-other-window))
#+end_src

~dirvish~ makes navigating directories so much pleasant! Let's change a bit of key
bindings.
#+begin_src emacs-lisp
;; (map! :leader
;;       :prefix-map ("t" . "toggle")
;;       :desc "Side bar" :mvn "s" #'dirvish-side)

;; (map! :after dirvish
;;       :map dirvish-mode-map
;;       :n "S" #'dirvish-narrow
;;       :n "F" #'dirvish-layout-toggle)
#+end_src

** ~org~ ·
*** Configuration

I use ~syncthing~ to share files between my computers, it's also handy to sync
org files to my phone. Let's setup the org directory.
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Sync/Org/"
      org-agenda-files (directory-files-recursively "~/Sync/Org/" "\\.org$"))
#+END_SRC

Sometimes it is nice to be able to use the mouse.
#+begin_src emacs-lisp
(use-package! org-mouse)
#+end_src

~org~ is pretty great and with ~org-modern~ that'll setup later, it's pretty
pretty, but let's change some visual stuff anyway.

#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t
      org-fontify-quote-and-verse-blocks t ;; make quotes blocks /italic/
      org-ellipsis " ↩ ")
#+end_src

#+begin_src emacs-lisp
;; hide line numbers in olivetti mode
(defun daf/hide-line-numbers ()
  (display-line-numbers-mode 0))

(add-hook 'org-mode-hook 'daf/hide-line-numbers)
#+end_src


Some ~or-babel~ block might take too much space, so let's have a way to specify hidden block.
#+BEGIN_SRC emacs-lisp :hidden
(defun individual-visibility-source-blocks ()
  "Fold some blocks in the current buffer."
  (interactive)
  (org-show-block-all)
  (org-block-map
   (lambda ()
     (let ((case-fold-search t))
       (when (and
              (save-excursion
                (beginning-of-line 1)
                (looking-at org-block-regexp))
              (cl-assoc
               ':hidden
               (cl-third
                (org-babel-get-src-block-info))))
         (org-hide-block-toggle))))))

(add-hook
 'org-mode-hook
 (function individual-visibility-source-blocks))
#+END_SRC


*** ~org-appear~
#+begin_quote
Make invisible parts of Org elements appear visible.
#+end_quote

**** Configuration
#+begin_src emacs-lisp :tangle packages.el
(package! org-appear) ;; https://github.com/awth13/org-appear
#+end_src

Add a hook to ~org-mode~.
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-appear-mode)
#+end_src

*** ~org-modern~
