config.org
**** Configuration

#+begin_quote
Fontifying org-mode buffers to be as pretty as possible is of paramount
importance, and Minad’s lovely org-modern goes a long way in this regard.

---Tecosaur
#+end_quote


#+begin_src emacs-lisp :tangle packages.el
(package! org-modern)
#+end_src

This is shamelessly stolen from Tecosaur's, I'll need to customize more to my
liking and remove the things I don't use.

#+begin_src emacs-lisp
(after! org
  (use-package! org-modern
    :hook (org-mode . org-modern-mode)
    :config
    (setq org-modern-star '("◉" "○" "✸" "✿" "✤" "✜" "◆" "▶")
          org-modern-table-vertical 1
          org-modern-table-horizontal 0.2
          org-modern-list '((43 . "➤")
                            (45 . "–")
                            (42 . "•"))
          org-modern-todo-faces

          '(("TODO" :inverse-video t :inherit org-todo)
            ("PROJ" :inverse-video t :inherit +org-todo-project)
            ("STRT" :inverse-video t :inherit +org-todo-active)
            ("[-]"  :inverse-video t :inherit +org-todo-active)
            ("HOLD" :inverse-video t :inherit +org-todo-onhold)
            ("WAIT" :inverse-video t :inherit +org-todo-onhold)
            ("[?]"  :inverse-video t :inherit +org-todo-onhold)
            ("KILL" :inverse-video t :inherit +org-todo-cancel)
            ("NO"   :inverse-video t :inherit +org-todo-cancel))
          org-modern-footnote
          (cons nil (cadr org-script-display))
          org-modern-block-fringe nil
          org-modern-block-name
          '((t . t)
            ("src" "»" "«")
            ("example" "»–" "–«")
            ("quote" "❝" "❞")
            ("export" "⏩" "⏪"))
          org-modern-progress nil
          org-modern-priority nil
          org-modern-horizontal-rule (make-string 36 ?─)
          org-modern-keyword
          '((t . t)
            ("title" . "𝙏")
            ("subtitle" . "𝙩")
            ("author" . "𝘼")
            ("email" . #("" 0 1 (display (raise -0.14))))
            ("date" . "𝘿")
            ("property" . "☸")
            ("options" . "⌥")
            ("startup" . "⏻")
            ("macro" . "𝓜")
            ("bind" . #("" 0 1 (display (raise -0.1))))
            ("include" . "⇤")
            ("setupfile" . "⇚")
            ("name" . "⁍")
            ("header" . "›")
            ("caption" . "☰")
            ("RESULTS" . "🠶")))
    (custom-set-faces! '(org-modern-statistics :inherit org-checkbox-statistics-todo))))
#+end_src

*** ~org-modern-indent~
#+begin_quote
org-modern and org-indent, working together
---jdtsmith
#+end_quote

**** Configuration
Indenting headings in ~org-mode~ helps me find my way, so I was a bit sad when I
learned that it wasn't possible to see the nice block style with ~org-modern~.
~org-modern-indent~ to the rescue.
#+begin_src emacs-lisp :tangle packages.el
(package! org-modern-indent
  :recipe (:host github :repo "jdtsmith/org-modern-indent"))
#+end_src

#+begin_src  emacs-lisp
(use-package! org-modern-indent
  :hook
  (org-indent-mode . org-modern-indent-mode))
#+end_src
*** ~org-roam~
**** Configuration
#+begin_src emacs-lisp
(setq org-roam-directory "~/Sync/Org")
#+end_src
*** ~image-popup~
Viewing image in org buffer is nice, but I'd rather have a small thumbnail with
a popup image, rather than configuring for every image its size.

**** Configuration & Mapping

#+begin_src emacs-lisp :tangle packages.el
(package! image-popup
  :recipe (:host gitlab :repo "OlMon/image-popup"))
#+end_src

#+begin_src emacs-lisp
(use-package! image-popup
  :init
  (map!
   :map org-mode-map
   :prefix daf/localleader-key
   :n "i" #'image-popup-display-image-at-point))
#+end_src

* Level 5: Phobos Lab · Packages
** ~blamer~ · who wrote that crap!? (probably me.)
*** Configuration & Mapping

I sometimes need to quickly know who made a modification, ~blamer.el~ helps me
by showing commit information at a glance.

#+begin_src emacs-lisp :tangle packages.el
(package! blamer) ;; https://github.com/Artawower/blamer.el
#+end_src

Let's customize the face and add a few key bindings.
#+begin_src emacs-lisp
(use-package! blamer
  :defer 20
  :custom
  (blamer-idle-time 0.3)
  (blamer-min-offset 70)
  :custom-face
  (blamer-face ((t :foreground "#7a88cf"
                   :background nil
                   :italic t)))
  :init
  (map!
   :leader
   (:prefix-map ("g" . "git")
    :desc  "Blamer posframe commit info" "," #'blamer-show-posframe-commit-info
    :desc  "Blamer mode"                 ";" #'blamer-mode)))
#+end_src
** ~elogcat~ · android logs utility
Occasionally (only happen once to be honest) I need to debug an android app,
~elogcat~ allows me to get cleaner logs.

*** Configuration & Mapping
#+begin_src emacs-lisp :tangle packages.el
(package! elogcat)
#+end_src

I wrote some ugly function to add filters to ~logcat~.
#+begin_src emacs-lisp
(use-package! elogcat
  :config
  (defun daf/elogcat-set-tail ()
    "Add a limit of line to the command"
    (interactive)
    (setq elogcat-logcat-command (concat elogcat-logcat-command " -T 50")))

  (defun daf/elogcat-set-include-filter-pid ()
    "Try to determine a PID from an input, and set it as a filter"
    (interactive)
    (elogcat-set-include-filter (substring
                                 (shell-command-to-string
                                  (format "adb shell ps | grep -F %s | tr -s '[:space:]' ' ' | cut -d' ' -f2" (read-string "app namespace: ")))
                                 0 -1)))
  :init
  (map! :map elogcat-mode-map
        :localleader
        "i" #'elogcat-set-include-filter
        "I" #'elogcat-clear-include-filter
        "x" #'elogcat-set-exclude-filter
        "X" #'elogcat-clear-exclude-filter
        "p" #'daf/elogcat-set-include-filter-pid
        "t" #'daf/elogcat-set-tail
        "g" #'elogcat-show-status
        "m" #'elogcat-toggle-main
        "s" #'elogcat-toggle-system
        "e" #'elogcat-toggle-events
        "r" #'elogcat-toggle-radio
        "k" #'elogcat-toggle-kernel
        "c" #'elogcat-erase-buffer))
#+end_src
** ~emojify~ · 🐂
*** Configuration
Gotta love those emoji, right?

#+begin_src emacs-lisp
(setq emojify-display-style 'unicode)
(setq emojify-emoji-styles '(unicode))
#+end_src

#+begin_quote
One minor annoyance is the use of emojis over the default character when the
default is actually preferred. This occurs with overlay symbols I use in Org
mode, such as checkbox state, and a few other miscellaneous cases.

We can accommodate our preferences by deleting those entries from the emoji hash
table

---Tecosaur
#+end_quote

#+begin_src emacs-lisp
(defvar emojify-disabled-emojis
  '(;; Org
    "◼" "☑" "☸" "⚙" "⏩" "⏪" "⬆" "⬇" "❓"
    ;; Terminal powerline
    "✔"
    ;; Box drawing
    "▶" "◀"
    ;; I just want to see this as text
    "©" "™")
  "Characters that should never be affected by `emojify-mode'.")

(defadvice! emojify-delete-from-data ()
  "Ensure `emojify-disabled-emojis' don't appear in `emojify-emojis'."
  :after #'emojify-set-emoji-data
  (dolist (emoji emojify-disabled-emojis)
    (remhash emoji emojify-emojis)))
#+end_src
** ~fancy-dabbrev~ · ~dabbrev~ enhanced
*** Configuration
#+begin_src emacs-lisp :tangle packages.el
;; (package! fancy-dabbrev)
#+end_src

#+begin_src emacs-lisp
;; (use-package! fancy-dabbrev
;;   :hook
;;   (prog-mode . fancy-dabbrev-mode)
;;   (org-mode . fancy-dabbrev-mode)
;;   :config
;;   ;; (setq fancy-dabbrev-preview-delay 0.1)
;;   (setq fancy-dabbrev-preview-context 'before-non-word)
;;   ;; Let dabbrev searches ignore case and expansions preserve case:
;;   (setq dabbrev-case-distinction nil)
;;   (setq dabbrev-case-fold-search t)
;;   (setq dabbrev-case-replace nil)
;;   (add-hook 'minibuffer-setup-hook (lambda () (fancy-dabbrev-mode 0)))
;;   (add-hook 'minibuffer-exit-hook (lambda () (fancy-dabbrev-mode 1))))
#+end_src

** ~languagetool~ · Squiggly line my prose
Doom's ship ~Emacs-langtool~ but I prefer ~languagetool.el~, let's set it up.

**** Configuration & Mapping
#+begin_src emacs-lisp :tangle packages.el
(package! languagetool) ;; https://github.com/PillFall/languagetool.el
#+end_src

~languagetool~ being a Java program, it needs to be shown the way to its .jar,
let's obliged.
#+begin_src emacs-lisp
(use-package! languagetool
  :config
  (setq languagetool-java-arguments '("-Dfile.encoding=UTF-8")
        languagetool-correction-language "en-US"  ;; 'auto' seems to target "en", which isn't working as well as 'en-US'
        languagetool-console-command "/etc/profiles/per-user/daf/share/languagetool-commandline.jar"
        languagetool-server-command "/etc/profiles/per-user/daf/share/languagetool-server.jar")
  :init
  (map!
   (:prefix ("z~" . "languagetool")
    :n "b" #'languagetool-correct-buffer
    :n "c" #'languagetool-correct-at-point
    :desc "set language" :n "l" #'(lambda() (interactive) (languagetool-set-language (completing-read "lang: " '("fr" "en-US"))))
    :n "~" #'languagetool-check)))
#+end_src
** ~olivetti~
*** Configuration
#+begin_src emacs-lisp :tangle packages.el
(package! olivetti)
#+end_src

#+begin_src emacs-lisp
(use-package olivetti
  :config
  (setq olivetti-body-width 90))
#+end_src
** ~logos~ · Focus mode
