packages.el

(package! image-popup
  :recipe (:host gitlab :repo "OlMon/image-popup"))

(package! blamer) ;; https://github.com/Artawower/blamer.el

(package! elogcat)

;; (package! fancy-dabbrev)

(package! languagetool) ;; https://github.com/PillFall/languagetool.el

(package! olivetti)

(package! logos)
