config.org
*** Configuration
#+begin_src emacs-lisp :tangle packages.el
(package! logos)
#+end_src

#+begin_src emacs-lisp
(use-package! logos
  :after org-mode
  :config
  ;; ;; This is the default value for the outlines:
  ;; (setq logos-outline-regexp-alist
  ;;       `((emacs-lisp-mode . "^;;;+ ")
  ;;         (org-mode . "^\\*+ +")
  ;;         (markdown-mode . "^\\#+ +")
  ;;         (t . ,(if (boundp 'outline-regexp) outline-regexp logos--page-delimiter))))

  ;; These apply when `logos-focus-mode' is enabled.  Their value is
  ;; buffer-local.
  (setq-default logos-hide-cursor nil
                logos-hide-mode-line t
                logos-hide-buffer-boundaries t
                logos-hide-fringe t
                logos-variable-pitch nil
                logos-buffer-read-only nil
                logos-scroll-lock nil
                logos-olivetti t)
  :init
  (map! :leader
        (:prefix "t"
         :desc "Logos" "L" #'logos-focus-mode))
  )
#+end_src
** ~magit-pretty-graph~
*** Configuration & Mapping
#+begin_src emacs-lisp :tangle packages.el
(package! magit-pretty-graph
  :recipe (:host github
           :repo "georgek/magit-pretty-graph"))
#+end_src

#+begin_src emacs-lisp
(use-package! magit-pretty-graph
  :after magit
  :init
  (setq magit-pg-command
        (concat "git --no-pager log"
                " --topo-order --decorate=full"
                " --pretty=format:\"%H%x00%P%x00%an%x00%ar%x00%s%x00%d\""
                " -n 2000")) ;; Increase the default 100 limit

  (map! :localleader
        :map (magit-mode-map)
        :desc "Magit pretty graph" "p" (cmd! (magit-pg-repo (magit-toplevel)))))
#+end_src

** ~ef-themes~
*** Configuration
Prot's at it again with another great package and great themes.
#+begin_src emacs-lisp :tangle packages.el
(package! ef-themes)
#+end_src

We want our ~org~ headings to be of different size to be more distinguishable.
#+begin_src emacs-lisp
(use-package! ef-themes
  :config
  (setq ef-themes-variable-pitch-ui t
        ef-themes-mixed-fonts t
        ef-themes-headings           ; read the manual's entry of the doc string
        '((0 . (variable-pitch regular 1.7))
          (1 . (variable-pitch regular 1.6))
          (2 . (variable-pitch regular 1.5))
          (3 . (variable-pitch regular 1.4))
          (4 . (variable-pitch regular 1.3))
          (5 . (variable-pitch regular 1.3)) ; absence of weight means `bold'
          (6 . (variable-pitch regular 1.2))
          (7 . (variable-pitch regular 1.1))
          (t . (variable-pitch regular 1.1))))
  (defun my-ef-themes-hl-todo-faces ()
    "Configure `hl-todo-keyword-faces' with Ef themes colors.
The exact color values are taken from the active Ef theme."
    (ef-themes-with-colors
      (setq hl-todo-keyword-faces
            `(("HOLD" . ,yellow)
              ("TODO" . ,red)
              ("NEXT" . ,blue)
              ("THEM" . ,magenta)
              ("PROG" . ,cyan-warmer)
              ("OKAY" . ,green-warmer)
              ("DONT" . ,yellow-warmer)
              ("FAIL" . ,red-warmer)
              ("BUG" . ,red-warmer)
              ("DONE" . ,green)
              ("NOTE" . ,blue-warmer)
              ("KLUDGE" . ,cyan)
              ("HACK" . ,cyan)
              ("TEMP" . ,red)
              ("FIXME" . ,red-warmer)
              ("XXX+" . ,red-warmer)
              ("REVIEW" . ,red)
              ("DEPRECATED" . ,yellow)))))

  (add-hook 'ef-themes-post-load-hook #'my-ef-themes-hl-todo-faces)
  :init
  (map! :leader
        (:prefix-map ("t" . "toggle")
         :desc "Toggle ef-themes" :mvn "t" #'ef-themes-toggle)))
#+end_src

** ~modus-themes~
*** Configuration
The ~modus-themes~ are builtin to Emacs, they are that great! But I want the latest version possible.
#+begin_src emacs-lisp :tangle packages.el
(package! modus-themes)
#+end_src
Also, let's set it up in a similar fashion that we did with ~ef-themes~.
#+begin_src emacs-lisp
(use-package! modus-themes
  :config
  (setq modus-themes-variable-pitch-ui t
        modus-themes-mixed-fonts t
        modus-themes-headings ; read the manual's entry of the doc string
        '((0 . (variable-pitch light 1.7))
          (1 . (variable-pitch light 1.6))
          (2 . (variable-pitch regular 1.5))
          (3 . (variable-pitch regular 1.4))
          (4 . (variable-pitch regular 1.3))
          (5 . (variable-pitch 1.2)) ; absence of weight means `bold'
          (6 . (variable-pitch 1.1))
          (7 . (variable-pitch 1.0))
          (t . (variable-pitch 1.0)))))
#+end_src

** ~fontaine~ · Maître Corbeau, sur un arbre perché
