packages.el

(package! magit-pretty-graph
  :recipe (:host github
           :repo "georgek/magit-pretty-graph"))

(package! ef-themes)

(package! modus-themes)
