config.org
*** Configuration
#+begin_src emacs-lisp :tangle packages.el
(package! fontaine)
#+end_src
#+begin_src emacs-lisp
(use-package! fontaine
  :config
  ;; This is defined in Emacs C code: it belongs to font settings.
  (setq x-underline-at-descent-line nil)

  ;; And this is for Emacs28.
  (setq-default text-scale-remap-header-line t)

  ;; This is the default value.  Just including it here for
  ;; completeness.
  (setq fontaine-latest-state-file (locate-user-emacs-file "fontaine-latest-state.eld"))

  ;; Iosevka Comfy is my highly customised build of Iosevka with
  ;; monospaced and duospaced (quasi-proportional) variants as well as
  ;; support or no support for ligatures:
  ;; <https://git.sr.ht/~protesilaos/iosevka-comfy>.
  ;;
  ;; Iosevka Comfy            == monospaced, supports ligatures
  ;; Iosevka Comfy Fixed      == monospaced, no ligatures
  ;; Iosevka Comfy Duo        == quasi-proportional, supports ligatures
  ;; Iosevka Comfy Wide       == like Iosevka Comfy, but wider
  ;; Iosevka Comfy Wide Fixed == like Iosevka Comfy Fixed, but wider
  ;; Iosevka Comfy Motion     == monospaced, supports ligatures, fancier glyphs
  ;; Iosevka Comfy Motion Duo == as above, but quasi-proportional
  (setq fontaine-presets
        '((smaller
           :default-family "Iosevka Comfy Wide Fixed"
           :default-height 100
           :variable-pitch-family "Iosevka Comfy Wide Duo")
          (small
           :default-family "Iosevka Comfy Wide Fixed"
           :default-height 120
           :variable-pitch-family "Iosevka Comfy Wide Duo")
          (regular
           :default-height 140)
          (large
           :default-weight semilight
           :default-height 150
           :bold-weight extrabold)
          (larger
           :default-weight semilight
           :default-height 160
           :bold-weight extrabold)
          (code-demo
           :default-family "Iosevka Comfy Fixed"
           :default-weight semilight
           :default-height 190
           :variable-pitch-family "Iosevka Comfy Duo"
           :bold-weight extrabold)
          (presentation
           :default-weight semilight
           :default-height 220
           :bold-weight extrabold)
          (legally-blind
           :default-weight semilight
           :default-height 260
           :bold-weight extrabold)
          (ibm-plex-sans
           :default-family "IBM Plex Sans")
          (ibm-plex-mono
           :default-family "IBM Plex Mono")
          (t
           ;; I keep all properties for didactic purposes, but most can be
           ;; omitted.  See the fontaine manual for the technicalities:
           ;; <https://protesilaos.com/emacs/fontaine>.
           :default-family "Iosevka Comfy"
           :default-weight regular
           :default-height 140
           :fixed-pitch-family nil ; falls back to :default-family
           :fixed-pitch-weight nil ; falls back to :default-weight
           :fixed-pitch-height 1.0
           :fixed-pitch-serif-family nil ; falls back to :default-family
           :fixed-pitch-serif-weight nil ; falls back to :default-weight
           :fixed-pitch-serif-height 1.0
           :variable-pitch-family "Iosevka Comfy Motion Duo"
           :variable-pitch-weight nil
           :variable-pitch-height 1.0
           :bold-family nil ; use whatever the underlying face has
           :bold-weight bold
           :italic-family nil
           :italic-slant italic
           :line-spacing nil)))

  ;; Set last preset or fall back to desired style from `fontaine-presets'.
  (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))

  ;; The other side of `fontaine-restore-latest-preset'.
  (add-hook 'kill-emacs-hook #'fontaine-store-latest-preset)

  ;; Persist font configurations while switching themes (doing it with
  ;; my `modus-themes' and `ef-themes' via the hooks they provide).
  (dolist (hook '(modus-themes-after-load-theme-hook ef-themes-post-load-hook))
    (add-hook hook #'fontaine-apply-current-preset))

  (define-key global-map (kbd "C-c f") #'fontaine-set-preset)
  (define-key global-map (kbd "C-c F") #'fontaine-set-face-font))
#+end_src
** ~rotate~
*** Configuration & Mapping
A nice little package which allows to rotate layout.

#+begin_src emacs-lisp :tangle packages.el
(package! rotate)
#+end_src

#+begin_src emacs-lisp
(map! :map evil-window-map
      "SPC" #'rotate-layout)
#+end_src

** ~multi-vterm~
*** Configuration & Mapping
#+begin_src emacs-lisp :tangle packages.el
(package! multi-vterm
  :recipe (:host github :repo "gagbo/multi-vterm" :branch "display_buffer"))
#+end_src

#+begin_src emacs-lisp
(use-package! multi-vterm
  :custom
  (multi-vterm-buffer-name "Terminal")
  (multi-vterm-dedicated-window-side 'bottom)
  (multi-vterm-dedicated-buffer-name "Popup terminal")

  :config
  (map! :leader :desc "Dedicated terminal" "ot" #'multi-vterm-dedicated-toggle
        :leader :desc "Open terminal" "p!" #'multi-vterm-project)
  (map! (:map vterm-mode-map
         :localleader
         (:prefix ("m" . "Multi vterm")
          :desc "Create" "c" #'multi-vterm
          :desc "Previous" "p" #'multi-vterm-prev
          :desc "Next" "n" #'multi-vterm-next)))

  (set-popup-rules!
    '(("^\\*Terminal"
       :actions (display-buffer-in-side-window)
       :slot 2 :vslot -1 :side right :width 0.5 :quit nil)))

  (evil-define-key 'normal vterm-mode-map (kbd "C-d") #'vterm--self-insert)
  (evil-define-key 'normal vterm-mode-map (kbd ",c")  #'multi-vterm)
  (evil-define-key 'normal vterm-mode-map (kbd ",n")  #'multi-vterm-next)
  (evil-define-key 'normal vterm-mode-map (kbd ",p")  #'multi-vterm-prev))
#+end_src

** ~vundo~
**** Configuration & Mapping
#+begin_src emacs-lisp :tangle packages.el
(package! vundo)
#+end_src

#+begin_src emacs-lisp
(use-package! vundo
  :unless (modulep! +tree)
  :custom
  (vundo-glyph-alist vundo-unicode-symbols)
  (vundo-compact-display t)
  :config
  (when (modulep! :editor evil)
    (map! :map vundo-mode-map
          [remap doom/escape] #'vundo-quit))
  :init
  (evil-define-key* 'normal 'global "U" #'vundo)
  :defer t)
#+end_src

** ~verb~
*** Configuration & Mapping
#+begin_src emacs-lisp :tangle packages.el
(package! verb)
#+end_src

#+begin_src emacs-lisp
(use-package! verb
  :config
  (defun graphql-to-json (rs)
    ;; Modify RS and return it (RS is a request specification, type `verb-request-spec')
    (oset rs body (replace-regexp-in-string "\n" "" (format-message "{\"query\": \"%s\"}" (oref rs body))))
    rs)

  (defun json-to-json (rs)
    ;; Modify RS and return it (RS is a request specification, type `verb-request-spec')
    (message rs)
    rs)
  :init
  (map!
   :leader
   (:prefix-map ("v" . "verb")
    :desc "send request"              "V" #'verb-send-request-on-point-other-window
    :desc "send request other window" "v" #'verb-send-request-on-point-other-window-stay
    :desc "re-send request"           "r" #'verb-re-send-request
    :desc "export curl request"       "c" #'verb-export-request-on-point-curl
    (:prefix-map ("h" . "verb help")
     :desc "show sent request" "r" #'verb-show-request
     :desc "show headers"      "h" #'verb-toggle-show-headers
     :desc "show vars"         "v" #'verb-show-vars
     :desc "show logs"         "l" #'verb-show-log
     :desc "set var"           "s" #'verb-set-var
     :desc "unset vars"        "u" #'verb-unset-vars))))
#+end_src

* Level 6: Central Processing · Lang stuff
** nix
*** Configuration
I am currently trying « ~nil~ » (yeah it's confusing) as nix's lsp server. Let's
set it up with ~lsp-mode~.
#+begin_src emacs-lisp
(after! lsp-mode
  (add-to-list 'lsp-language-id-configuration '(nix-mode . "nix"))
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("nil"))
                    :major-modes '(nix-mode)
                    :server-id 'nix)))
#+end_src
** Plain text
*** Configuration
#+begin_quote
Ispell is nice, let’s have it in text, markdown, and GFM.
---Tecosaur
#+end_quote

#+begin_src emacs-lisp
(set-company-backend!
  '(text-mode
    markdown-mode
    gfm-mode)
  '(:seperate
    company-ispell
    company-files
    company-yasnippet))
#+end_src
** Javascript
*** Configuration
QUICKFIX
#+begin_src emacs-lisp
(advice-add #'add-node-modules-path :override #'ignore)
#+end_src

* Level x: Sewers · It never ends…
« Confing » Emacs is a never ending story, I'll always have stuff to tweak, new
packages to try out and bug or unsatisfactory workflow, I reference all that
here.
** Known Issues
- [ ] ~doom-modeline~ isn't happy about font profile switching
- [X] (layout +bepo) isn't working
- [X] ~company~ glitches with variable fonts (maybe?)
  ~+childframe~ seems to have fixed the issue.
- [ ] emojis and symbols are giving me trouble
