packages.el

(package! fontaine)

(package! rotate)

(package! multi-vterm
  :recipe (:host github :repo "gagbo/multi-vterm" :branch "display_buffer"))

(package! vundo)

(package! verb)
