config.org
** Todos
- [X] migrate elogcat stuff for android
- [-] finish font setup
  - [X] Iosevka Comfy Wide Duo isn't available on my system
  - [ ] setup Overpass font (to try it out)
- [ ] add ~nov.el~ maybe a private module?
- [ ] add ~verb.el~ maybe a private module?

* Sandbox

#+begin_src emacs-lisp :tangle packages.el
(package! ts-comint)
#+end_src


#+begin_src emacs-lisp
(defun my-imenu-function ()
  (interactive)
  (imenu (imenu-choose-buffer-index "Jump to function: "
                                    (alist-get "Function"
                                               (imenu--make-index-alist)
                                               nil
                                               nil
                                               'string=))))
(defun my-imenu-class ()
  (interactive)
  (imenu (imenu-choose-buffer-index "Jump to class: "
                                    (alist-get "Class"
                                               (imenu--make-index-alist)
                                               nil
                                               nil
                                               'string=))))
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! imenu+)
#+end_src
