config.el

(defun my-imenu-function ()
  (interactive)
  (imenu (imenu-choose-buffer-index "Jump to function: "
                                    (alist-get "Function"
                                               (imenu--make-index-alist)
                                               nil
                                               nil
                                               'string=))))
(defun my-imenu-class ()
  (interactive)
  (imenu (imenu-choose-buffer-index "Jump to class: "
                                    (alist-get "Class"
                                               (imenu--make-index-alist)
                                               nil
                                               nil
                                               'string=))))
